;==================================================================================================================================================

;==================================================================================================================================================

; 輸入/dd則替換成當日日期；%A_YYYY%是系統變數，表示年度
::/d::
  FormatTime, TimeString,,yyyy/MM/dd ddd
  SendInput %TimeString%{Enter}
return
; 輸入/dd則替換成當日日期；%A_YYYY%是系統變數，表示年度
; ::/dd::
; 	d = %A_YYYY%/%A_MM%/%A_DD%

; 	Send %d%
; return

;==================================================================================================================================================
;Notes: #==win !==Alt 2015-05-20  ^==Ctrl  +==shift

;==================================================================================================================================================
;快速?入

; ???
; ::/c::console.log();
; ::/s::skyran1278@gmail.com
; ::/a::新北市三重區忠孝路二段65巷1弄5號九樓

;================================================================================================================================================
; 下面是系?操作
; 一?拷?文件路?
; Ctrl+Shift+C-> Copy the file path
; ---------------------------------------------------------
; ^+c::
; {
;     ; null=
;     send ^c
;     sleep, 5000
;     clipboard = %clipboard% ;%null%
;     ; clipboard = Timed ToolTip`nThis will be displayed for 5 seconds.
;     tooltip, %clipboard%
;     sleep, 5000
;     tooltip,
;     return
; }
; #c::
;     SendInput ^c
;     clipboard = %clipboard%
; return

; ---------------------------------------------------------

;================================================================================================================================================
;下面是快速??程序

; Shift+Alt+S -> Sublime(Run/Activate/Minimize)
; ---------------------------------------------------------
; +!S::
;     DetectHiddenWindows, on
;     ifWinNotExist ahk_class PX_WINDOW_CLASS
;         Run C:\Program Files\Sublime Text 3\sublime_text.exe
;         ; Run C:\app\Sublime_Text_3_ionic\sublime_text.exe
;     else
;     {
;         ifWinNotActive ahk_class PX_WINDOW_CLASS
;             WinActivate
;         else
;             WinMinimize
;     }
; Return

; ---------------------------------------------------------
